CSI API ETABS v1

# eItemType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eItemType

    Public Enumeration eItemType

    Dim instance As eItemType

    public enum class eItemType

    type eItemType

Members

| Member name| Value| Description
---|---|---|---
| Objects| 0|
| Group| 1|
| SelectedObjects| 2|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com